app/controllers/students_controller.rb

  def update
    @student = Student.find(params[:id])
    @student.update(strong_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-07-02 09:37:18.054474"], ["id", 1]]

  def create
    @student = Student.create(strong_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-07-02 09:20:23.973560"], ["updated_at", "2018-07-02 09:20:23.973560"]]